{"CaseOrder": "A placeholder variable to preserve the original order of the raw data file.",
    "Customer_id": "Unique customer ID.",
    "UID": "Unique IDs related to customer transactions, technical support, and sign-ups.",
    "City": "Customer city of residence as listed on the billing statement.",
    "State": "Customer state of residence as listed on the billing statement.",
    "County": "Customer county of residence as listed on the billing statement.",
    "Zip": "Customer zip code of residence as listed on the billing statement.",
    "Lat": "GPS coordinates of customer residence as listed on the billing statement.",
    "Lng": "GPS coordinates of customer residence as listed on the billing statement.",
    "Population": "Population within a mile radius of customer, based on census data.",
    "Area": "Area type (rural, urban, suburban), based on census data.",
    "TimeZone": "Time zone of customer residence based on customer’s sign-up information.",
    "Job": "Job of the customer (or invoiced person) as reported in sign-up information.",
    "Children": "Number of children in customer’s household as reported in sign-up information.",
    "Age": "Age of customer as reported in sign-up information.",
    "Education": "Highest degree earned by customer as reported in sign-up information.",
    "Employment": "Employment status of customer as reported in sign-up information.",
    "Income": "Annual income of customer as reported at the time of sign-up.",
    "Marital": "Marital status of customer as reported in sign-up information.",
    "Churn": "Whether the customer discontinued service within the last month (yes, no).",
    "Outage_sec_perweek": "Average number of seconds per week of system outages in the customer’s neighborhood.",
    "Email": "Number of emails sent to the customer in the last year (marketing or correspondence).",
    "Contacts": "Number of times customer contacted technical support.",
    "Yearly_equip_failure": "The number of times customer’s equipment failed and had to be reset/replaced in the past year.",
    "Techie": "Whether the customer considers themselves technically inclined (based on customer questionnaire when they signed up for services) (yes, no).",
    "Contract": "The contract term of the customer (month-to-month, one year, two years).",
    "Port_modem": "Whether the customer has a portable modem (yes, no).",
    "Tablet": "Whether the customer owns a tablet such as iPad, Surface, etc. (yes, no).",
    "InternetService": "Customer’s internet service provider (DSL, fiber optic, None).",
    "Phone": "Whether the customer has a phone service (yes, no).",
    "Multiple": "Whether the customer has multiple lines (yes, no).",
    "OnlineSecurity": "Whether the customer has an online security add-on (yes, no).",
    "OnlineBackup": "Whether the customer has an online backup add-on (yes, no).",
    "DeviceProtection": "Whether the customer has device protection add-on (yes, no).",
    "TechSupport": "Whether the customer has a technical support add-on (yes, no).",
    "StreamingTV": "Whether the customer has streaming TV (yes, no).",
    "StreamingMovies": "Whether the customer has streaming movies (yes, no).",
    "PaperlessBilling": "Whether the customer has paperless billing (yes, no).",
    "PaymentMethod": "The customer’s payment method (electronic check, mailed check, bank (automatic bank transfer), credit card (automatic)).",
    "Tenure": "Number of months the customer has stayed with the provider.",
    "MonthlyCharge": "The amount charged tthe customer monthly. This value reflects an average per customer.",
    "Bandwidth_GB_Year": "The average amount of data used, in GB, in a year by the customer.",
    "TimelyResponse": "Response from an 8 question survery in regards to timely responses.",
    "TimelyFix": "Response from an 8 question survery in regards to timely fixes.",
    "TimelyReplacement": "Response from an 8 question survery in regards to timely replacements.",
    "Reliability": "Response from an 8 question survery in regards to service reliability.",
    "Options": "Response from an 8 question survery in regards to available options.",
    "Respectful": "Response from an 8 question survery in regards to respectful customer service representative.",
    "Courteous": "Response from an 8 question survery in regards to courteous customer service representative.",
    "ActiveListening": "Response from an 8 question survery in regards to active listening from the customer service representative."}